OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1782.h
#define _P1PRST                 0x01
#define _P1PRSC1                0x02
#define _P1PRSC2                0x04
#define _P1PRSC3                0x08
#define _P1PRSIN                0x80

//==============================================================================


//==============================================================================
//        PSMC1ASDC Bits

extern __at(0x081D) __sfr PSMC1ASDC;

typedef struct
  {
  unsigned P1ASDOV              : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned P1ARSEN              : 1;
  unsigned P1ASDEN              : 1;
  unsigned P1ASE                : 1;
  } __PSMC1ASDCbits_t;

extern __at(0x081D) volatile __PSMC1ASDCbits_t PSMC1ASDCbits;

#define _P1ASDOV                0x01
#define _P1ARSEN                0x20
#define _P1ASDEN                0x40
#define _P1ASE                  0x80

//==============================================================================


//==============================================================================
//        PSMC1ASDL Bits

extern __at(0x081E) __sfr PSMC1ASDL;

typedef struct
  {
  unsigned P1ASDLA              : 1;
  unsigned P1ASDLB              : 1;
  unsigned P1ASDLC              : 1;
  unsigned P1ASDLD              : 1;
  unsigned P1ASDLE              : 1;
  unsigned P1ASDLF              : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __PSMC1ASDLbits_t;

extern __at(0x081E) volatile __PSMC1ASDLbits_t PSMC1ASDLbits;

#define _P1ASDLA                0x01
#define _P1ASDLB                0x02
#define _P1ASDLC                0x04
#define _P1ASDLD                0x08
#define _P1ASDLE                0x10
#define _P1ASDLF                0x20

//==============================================================================


//==============================================================================
//        PSMC1ASDS Bits

extern __at(0x081F) __sfr PSMC1ASDS;

typedef struct
  {
  unsigned                      : 1;
  unsigned P1ASDSC1             : 1;
  unsigned P1ASDSC2             : 1;
  unsigned P1ASDSC3             : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned P1ASDSIN             : 1;
  } __PSMC1ASDSbits_t;

extern __at(0x081F) volatile __PSMC1ASDSbits_t PSMC1ASDSbits;

#define _P1ASDSC1               0x02
#define _P1ASDSC2               0x04
#define _P1ASDSC3               0x08
#define _P1ASDSIN               0x80

//==============================================================================


//==============================================================================
//        PSMC1INT Bits

extern __at(0x0820) __sfr PSMC1INT;

typedef struct
  {
  unsigned P1TPRIF              : 1;
  unsigned P1TDCIF              : 1;
  unsigned P1TPHIF              : 1;
  unsigned P1TOVIF              : 1;
  unsigned P1TPRIE              : 1;
  unsigned P1TDCIE              : 1;
  unsigned P1TPHIE              : 1;
  unsigned P1TOVIE              : 1;
  } __PSMC1INTbits_t;

extern __at(0x0820) volatile __PSMC1INTbits_t PSMC1INTbits;

#define _P1TPRIF                0x01
#define _P1TDCIF                0x02
#define _P1TPHIF                0x04
#define _P1TOVIF                0x08
#define _P1TPRIE                0x10
#define _P1TDCIE                0x20
#define _P1TPHIE                0x40
#define _P1TOVIE                0x80

//==============================================================================

extern __at(0x0821) __sfr PSMC1PH;

//==============================================================================
//        PSMC1PHL Bits

extern __at(0x0821) __sfr PSMC1PHL;

typedef struct
  {
  unsigned PSMC1PH0             : 1;
  unsigned PSMC1PH1             : 1;
  unsigned PSMC1PH2             : 1;
  unsigned PSMC1PH3             : 1;
  unsigned PSMC1PH4             : 1;
  unsigned PSMC1PH5             : 1;
  unsigned PSMC1PH6             : 1;
  unsigned PSMC1PH7             : 1;
  } __PSMC1PHLbits_t;

extern __at(0x0821) volatile __PSMC1PHLbits_t PSMC1PHLbits;

#define _PSMC1PH0               0x01
#define _PSMC1PH1               0x02
#define _PSMC1PH2               0x04
#define _PSMC1PH3               0x08
#define _PSMC1PH4               0x10
#define _PSMC1PH5               0x20
#define _PSMC1PH6               0x40
#define _PSMC1PH7               0x80

//==============================================================================


//==============================================================================
//        PSMC1PHH Bits

extern __at(0x0822) __sfr PSMC1PHH;

typedef struct
  {
  unsigned PSMC1PH8             : 1;
  unsigned PSMC1PH9             : 1;
  unsigned PSMC1PH10            : 1;
  unsigned PSMC1PH11            : 1;
  unsigned PSMC1PH12            : 1;
  unsigned PSMC1PH13            : 1;
  unsigned PSMC1PH14            : 1;
  unsigned PSMC1PH15            : 1;
  } __PSMC1PHHbits_t;

extern __at(0x0822) volatile __PSMC1PHHbits_t PSMC1PHHbits;

#define _PSMC1PH8               0x01
#define _PSMC1PH9               0x02
#define _PSMC1PH10              0x04
#define _PSMC1PH11              0x08
#define _PSMC1PH12              0x10
#define _PSMC1PH13              0x20
#define _PSMC1PH14              0x40
#define _PSMC1PH15              0x80

//==============================================================================

extern __at(0x0823) __sfr PSMC1DC;

//==============================================================================
//        PSMC1DCL Bits

extern __at(0x0823) __sfr PSMC1DCL;

typedef struct
  {
  unsigned PSMC1DC0             : 1;
  unsigned PSMC1DC1             : 1;
  unsigned PSMC1DC2             : 1;
  unsigned PSMC1DC3             : 1;
  unsigned PSMC1DC4             : 1;
  unsigned PSMC1DC5             : 1;
  unsigned PSMC1DC6             : 1;
  unsigned PSMC1DC7             : 1;
  } __PSMC1DCLbits_t;

extern __at(0x0823) volatile __PSMC1DCLbits_t PSMC1DCLbits;

