OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1782.h
#define PSMC2PH8                PSMC2PHHbits.PSMC2PH8           // bit 0
#define PSMC2PH9                PSMC2PHHbits.PSMC2PH9           // bit 1
#define PSMC2PH10               PSMC2PHHbits.PSMC2PH10          // bit 2
#define PSMC2PH11               PSMC2PHHbits.PSMC2PH11          // bit 3
#define PSMC2PH12               PSMC2PHHbits.PSMC2PH12          // bit 4
#define PSMC2PH13               PSMC2PHHbits.PSMC2PH13          // bit 5
#define PSMC2PH14               PSMC2PHHbits.PSMC2PH14          // bit 6
#define PSMC2PH15               PSMC2PHHbits.PSMC2PH15          // bit 7

#define PSMC2PH0                PSMC2PHLbits.PSMC2PH0           // bit 0
#define PSMC2PH1                PSMC2PHLbits.PSMC2PH1           // bit 1
#define PSMC2PH2                PSMC2PHLbits.PSMC2PH2           // bit 2
#define PSMC2PH3                PSMC2PHLbits.PSMC2PH3           // bit 3
#define PSMC2PH4                PSMC2PHLbits.PSMC2PH4           // bit 4
#define PSMC2PH5                PSMC2PHLbits.PSMC2PH5           // bit 5
#define PSMC2PH6                PSMC2PHLbits.PSMC2PH6           // bit 6
#define PSMC2PH7                PSMC2PHLbits.PSMC2PH7           // bit 7

#define P2PHST                  PSMC2PHSbits.P2PHST             // bit 0
#define P2PHSC1                 PSMC2PHSbits.P2PHSC1            // bit 1
#define P2PHSC2                 PSMC2PHSbits.P2PHSC2            // bit 2
#define P2PHSC3                 PSMC2PHSbits.P2PHSC3            // bit 3
#define P2PHSIN                 PSMC2PHSbits.P2PHSIN            // bit 7

#define P2POLA                  PSMC2POLbits.P2POLA             // bit 0
#define P2POLB                  PSMC2POLbits.P2POLB             // bit 1
#define P2INPOL                 PSMC2POLbits.P2INPOL            // bit 6

#define PSMC2PR8                PSMC2PRHbits.PSMC2PR8           // bit 0
#define PSMC2PR9                PSMC2PRHbits.PSMC2PR9           // bit 1
#define PSMC2PR10               PSMC2PRHbits.PSMC2PR10          // bit 2
#define PSMC2PR11               PSMC2PRHbits.PSMC2PR11          // bit 3
#define PSMC2PR12               PSMC2PRHbits.PSMC2PR12          // bit 4
#define PSMC2PR13               PSMC2PRHbits.PSMC2PR13          // bit 5
#define PSMC2PR14               PSMC2PRHbits.PSMC2PR14          // bit 6
#define PSMC2PR15               PSMC2PRHbits.PSMC2PR15          // bit 7

#define PSMC2PR0                PSMC2PRLbits.PSMC2PR0           // bit 0
#define PSMC2PR1                PSMC2PRLbits.PSMC2PR1           // bit 1
#define PSMC2PR2                PSMC2PRLbits.PSMC2PR2           // bit 2
#define PSMC2PR3                PSMC2PRLbits.PSMC2PR3           // bit 3
#define PSMC2PR4                PSMC2PRLbits.PSMC2PR4           // bit 4
#define PSMC2PR5                PSMC2PRLbits.PSMC2PR5           // bit 5
#define PSMC2PR6                PSMC2PRLbits.PSMC2PR6           // bit 6
#define PSMC2PR7                PSMC2PRLbits.PSMC2PR7           // bit 7

#define P2PRST                  PSMC2PRSbits.P2PRST             // bit 0
#define P2PRSC1                 PSMC2PRSbits.P2PRSC1            // bit 1
#define P2PRSC2                 PSMC2PRSbits.P2PRSC2            // bit 2
#define P2PRSC3                 PSMC2PRSbits.P2PRSC3            // bit 3
#define P2PRSIN                 PSMC2PRSbits.P2PRSIN            // bit 7

#define P2REBSC1                PSMC2REBSbits.P2REBSC1          // bit 1
#define P2REBSC2                PSMC2REBSbits.P2REBSC2          // bit 2
#define P2REBSC3                PSMC2REBSbits.P2REBSC3          // bit 3
#define P2REBSIN                PSMC2REBSbits.P2REBSIN          // bit 7

#define P2STRA                  PSMC2STR0bits.P2STRA            // bit 0
#define P2STRB                  PSMC2STR0bits.P2STRB            // bit 1

#define P2HSMEN                 PSMC2STR1bits.P2HSMEN           // bit 0
#define P2LSMEN                 PSMC2STR1bits.P2LSMEN           // bit 1
#define P2SSYNC                 PSMC2STR1bits.P2SSYNC           // bit 7

#define P2SYNC0                 PSMC2SYNCbits.P2SYNC0           // bit 0
#define P2SYNC1                 PSMC2SYNCbits.P2SYNC1           // bit 1

#define PSMC2TMR8               PSMC2TMRHbits.PSMC2TMR8         // bit 0
#define PSMC2TMR9               PSMC2TMRHbits.PSMC2TMR9         // bit 1
#define PSMC2TMR10              PSMC2TMRHbits.PSMC2TMR10        // bit 2
#define PSMC2TMR11              PSMC2TMRHbits.PSMC2TMR11        // bit 3
#define PSMC2TMR12              PSMC2TMRHbits.PSMC2TMR12        // bit 4
#define PSMC2TMR13              PSMC2TMRHbits.PSMC2TMR13        // bit 5
#define PSMC2TMR14              PSMC2TMRHbits.PSMC2TMR14        // bit 6
#define PSMC2TMR15              PSMC2TMRHbits.PSMC2TMR15        // bit 7

#define PSMC2TMR0               PSMC2TMRLbits.PSMC2TMR0         // bit 0
#define PSMC2TMR1               PSMC2TMRLbits.PSMC2TMR1         // bit 1
#define PSMC2TMR2               PSMC2TMRLbits.PSMC2TMR2         // bit 2
#define PSMC2TMR3               PSMC2TMRLbits.PSMC2TMR3         // bit 3
#define PSMC2TMR4               PSMC2TMRLbits.PSMC2TMR4         // bit 4
#define PSMC2TMR5               PSMC2TMRLbits.PSMC2TMR5         // bit 5
#define PSMC2TMR6               PSMC2TMRLbits.PSMC2TMR6         // bit 6
#define PSMC2TMR7               PSMC2TMRLbits.PSMC2TMR7         // bit 7

#define RX9D                    RC1STAbits.RX9D                 // bit 0
#define OERR                    RC1STAbits.OERR                 // bit 1
#define FERR                    RC1STAbits.FERR                 // bit 2
#define ADDEN                   RC1STAbits.ADDEN                // bit 3
#define CREN                    RC1STAbits.CREN                 // bit 4
#define SREN                    RC1STAbits.SREN                 // bit 5
#define RX9                     RC1STAbits.RX9                  // bit 6
#define SPEN                    RC1STAbits.SPEN                 // bit 7

#define SLRCONA0                SLRCONAbits.SLRCONA0            // bit 0
#define SLRCONA1                SLRCONAbits.SLRCONA1            // bit 1
#define SLRCONA2                SLRCONAbits.SLRCONA2            // bit 2
#define SLRCONA3                SLRCONAbits.SLRCONA3            // bit 3
#define SLRCONA4                SLRCONAbits.SLRCONA4            // bit 4
#define SLRCONA5                SLRCONAbits.SLRCONA5            // bit 5
#define SLRCONA6                SLRCONAbits.SLRCONA6            // bit 6
#define SLRCONA7                SLRCONAbits.SLRCONA7            // bit 7

#define SLRCONB0                SLRCONBbits.SLRCONB0            // bit 0
#define SLRCONB1                SLRCONBbits.SLRCONB1            // bit 1
#define SLRCONB2                SLRCONBbits.SLRCONB2            // bit 2
#define SLRCONB3                SLRCONBbits.SLRCONB3            // bit 3
#define SLRCONB4                SLRCONBbits.SLRCONB4            // bit 4
#define SLRCONB5                SLRCONBbits.SLRCONB5            // bit 5
#define SLRCONB6                SLRCONBbits.SLRCONB6            // bit 6
#define SLRCONB7                SLRCONBbits.SLRCONB7            // bit 7

#define SLRCONC0                SLRCONCbits.SLRCONC0            // bit 0
#define SLRCONC1                SLRCONCbits.SLRCONC1            // bit 1
#define SLRCONC2                SLRCONCbits.SLRCONC2            // bit 2
#define SLRCONC3                SLRCONCbits.SLRCONC3            // bit 3
#define SLRCONC4                SLRCONCbits.SLRCONC4            // bit 4
#define SLRCONC5                SLRCONCbits.SLRCONC5            // bit 5
#define SLRCONC6                SLRCONCbits.SLRCONC6            // bit 6
#define SLRCONC7                SLRCONCbits.SLRCONC7            // bit 7

#define SSPM0                   SSP1CONbits.SSPM0               // bit 0
#define SSPM1                   SSP1CONbits.SSPM1               // bit 1
#define SSPM2                   SSP1CONbits.SSPM2               // bit 2
#define SSPM3                   SSP1CONbits.SSPM3               // bit 3
#define CKP                     SSP1CONbits.CKP                 // bit 4
#define SSPEN                   SSP1CONbits.SSPEN               // bit 5
#define SSPOV                   SSP1CONbits.SSPOV               // bit 6
#define WCOL                    SSP1CONbits.WCOL                // bit 7

#define SEN                     SSP1CON2bits.SEN                // bit 0
#define RSEN                    SSP1CON2bits.RSEN               // bit 1
#define PEN                     SSP1CON2bits.PEN                // bit 2
#define RCEN                    SSP1CON2bits.RCEN               // bit 3
#define ACKEN                   SSP1CON2bits.ACKEN              // bit 4
#define ACKDT                   SSP1CON2bits.ACKDT              // bit 5
#define ACKSTAT                 SSP1CON2bits.ACKSTAT            // bit 6
#define GCEN                    SSP1CON2bits.GCEN               // bit 7

#define DHEN                    SSP1CON3bits.DHEN               // bit 0
#define AHEN                    SSP1CON3bits.AHEN               // bit 1
#define SBCDE                   SSP1CON3bits.SBCDE              // bit 2
#define SDAHT                   SSP1CON3bits.SDAHT              // bit 3
#define BOEN                    SSP1CON3bits.BOEN               // bit 4
#define SCIE                    SSP1CON3bits.SCIE               // bit 5
#define PCIE                    SSP1CON3bits.PCIE               // bit 6
#define ACKTIM                  SSP1CON3bits.ACKTIM             // bit 7

#define BF                      SSP1STATbits.BF                 // bit 0
#define UA                      SSP1STATbits.UA                 // bit 1
#define R_NOT_W                 SSP1STATbits.R_NOT_W            // bit 2
#define S                       SSP1STATbits.S                  // bit 3
#define P                       SSP1STATbits.P                  // bit 4
#define D_NOT_A                 SSP1STATbits.D_NOT_A            // bit 5
#define CKE                     SSP1STATbits.CKE                // bit 6
#define SMP                     SSP1STATbits.SMP                // bit 7

